<template>
  <el-collapse  accordion v-model="activeName">
    <el-collapse-item :title="item.title" :name="item.id" v-for="item in afterData" :key="item.index" style="padding:0 20px;">
      <div v-for="item2 in item.content" :key="item2.index">{{item2}}</div>
    </el-collapse-item>
  </el-collapse>
</template>
<script>
export default {
  data() {
    return {
      activeName: null,
      data: [
        {
          id: 1,
          classId: 1,
          
          title: "1、如何注册成为会员？",
          content: [
            "· 用户进入彩票网站首页，在首页右侧点击'注册'，进入用户注册页面。 ",
            "· 在注册页面阅读并同意《彩票网络服务协议》。",
            "· 在注册页面填写相关信息并提交。",
            "· 系统返回成功信息，恭喜注册成功。"
          ]
        },
        {
          id: 2,
          classId: 1,
          
          title: "2、在彩票网站注册要收费吗？",
          content: ["· 注册新用户是免费的，不收取任何费用。"]
        },
        /* {
          id: 3,
          classId: 1,
          
          title: "2、在彩票网站注册要收费吗？",
          content: ["· 注册新用户是免费的，不收取任何费用。"]
        }, */
        {
          id: 4,
          classId: 1,
          
          title: "4、有银行卡就可以充值了吗？",
          content: [
            "用户拥有了银行卡后，即有多种充值方式可以充值： ",
            "· 已开通网上银行，使用第三方支付平台进行充值，方便、快捷。",
            "· 未开通网银，可以使用银行转账、微信或支付宝等方式进行充值。"
          ]
        },
        {
          id: 5,
          classId: 1,
          
          title: "5、如何开通网上支付？",
          content: [
            "开通银行卡网上支付功能，包括网上开通和现场开通两种方式： ",
            "· 网上开通：登录各大银行的官方网站在线开通。",
            "· 现场开通：前往各大银行的营业网点现场开通。"
          ]
        },
        {
          id: 6,
          classId: 1,
          
          title: "6、如何进行充值？",
          content: ["有多种充值方式供您选择，包括：银行转账、第三方支付、微信与支付宝等。"]
        },
        {
          id: 7,
          classId: 1,
          
          title: "7、充值要手续费吗？",
          content: ["充值安全、方便、快捷，不收取任何手续费。"]
        },
        {
          id: 8,
          classId: 1,
          
          title: "8、如何查看是否中奖？",
          content: ["登录后，点击首页右侧的'会员中心'，点击交易记录，然后勾选'奖金派送'，即可查看中奖记录。"]
        },
        {
          id: 9,
          classId: 1,
          
          title: "9、如何查询购买彩票的记录？",
          content: ["在'用户中心'左侧选择'交易记录'，即可查看购买彩票的记录。"]
        },
        {
          id: 10,
          classId: 1,
          
          title: "10、中奖后如何返奖？",
          content: ["本彩票'自动兑奖，自动返奖'，所有奖金均由网站系统自动开兑，并自动返还到用户的会员账户中。"]
        },
        {
          id: 11,
          classId: 1,
          
          title: "11、如何查询中奖详情？",
          content: ["1、用户登录后点击首页顶部的'用户中心'。",
          "2、在'用户中心'左侧选择'交易记录'，点击“交易明细”，然后店家“查看”即可查看中奖详情。"
          ]
        },
        {
          id: 12,
          classId: 1,
          
          title: "12、如何提款？",
          content: ["· 用户登录后点击首页右侧的'提款'进入提款页面，在提款页面输入提款金额及提款密码并确认。",
          "· 您的提款申请成功并经核对无误后，将通过银行转账方式提款，1到3分钟实时到账。支持全国所有大小银行。",
          "· 为了保障您的资金安全，公司提供7X24小时一对一服务。"
          ]
        },
        {
          id: 13,
          classId: 1,
          
          title: "13、提款需要手续费吗？",
          content: ["· 达到提款条件才能取款。 ",
          "· 提款不限次数，手续费根据网站设定。",
          "· 提款时所产生的银行手续费将全部由本网站为您承担。"
          ]
        },
        /* {
          id: 14,
          classId: 1,
          
          title: "2、在彩票网站注册要收费吗？",
          content: ["· 注册新用户是免费的，不收取任何费用。"]
        }, */
        {
          id: 15,
          classId: 1,
          
          title: "15、提款时需要注意哪些事项？",
          content: ["· 确认提款时提交的的银行信息的正确性。 ",
          "· 为了防止少数用户利用信用卡套现和洗钱的行为，保护正常用户的资金安全，本站针对提款做出如下规定： ",
          "1、用户需要达到一定的打码量，才能正常办理提款。 ",
          "2、发现异常的提款，要经过审核。"
          ]
        },
        /* {
          id: 16,
          classId: 1,
          
          title: "2、在彩票网站注册要收费吗？",
          content: ["· 注册新用户是免费的，不收取任何费用。"]
        }, */
        {
          id: 17,
          classId: 1,
          
          title: "17、网上投注的优势有哪些？",
          content: ["· 安全便捷：安全、方便、快捷，足不出户，轻松购彩。 ",
          "· 永无弃奖：大奖人工通知并自动返还，小奖自动返还。 ",
          "· 随时随地：无地域限制，除开奖时间外24小时投注。 ",
          "· 信息服务：提供全方位、多样化的彩票信息服务。"
          ]
        },
        {
          id: 18,
          classId: 1,
          
          title: "18、网上投注如何保证彩民利益？",
          content: ["· 自动返奖：'自动兑奖，自动返奖'，所有奖金均由网站系统自动开兑并自动返还到用户的账户中。 ",
          "· 公开查询：用户可以查询自己的投注记录、中奖记录以及资金明细记录，一切做到有据可查，数据公开。",
          "· 数据安全：投注数据及相关资料时时备份，网络系统独立设置、隔离并安装有大型硬、软防火墙，安全级别高，确保数据绝对安全。",
          ]
        },
        {
          id: 19,
          classId: 1,
          
          title: "19、对于用户使用本站投注服务的约定",
          content: ["· 用户根据自愿的原则，使用本站投注业务，并自己对自己提供的注册信息的真实性负责； ",
          "· 国家明令禁止一切洗钱行为，本站积极响应国家政策，严格控制。"]
        },
        {
          id: 20,
          classId: 1,
          
          title: "20、在本站购彩安全吗？",
          content: ["· 本站是福彩中心与体彩中心授权的合法的网上投注平台，所售彩票都是福彩中心与体彩中心正规发行的彩票。 · 本站彩票已在工信部备案，是真实有效合法的网上投注平台。 ",
          "· 本站彩票与多家网站达成购彩合作伙伴关系，比如百度、搜狐、搜狗、腾讯微信、支付宝等。"
          ]
        },
        {
          id: 21,
          classId: 1,
          
          title: "21、如何对网站服务进行投诉？",
          content: ["· 如有需要及时处理的事务，请点击页面右侧的在线客服。 ",
          "· 工作时间：7X24，永不间断"
          ]
        },
        {
          id: 22,
          classId: 2,
          
          title: "22、注册时用户需要注意什么？",
          content: ["· 用户名一旦提交，不可更改，请选择容易记忆且安全级别高的用户名，并妥善保管。 ",
          "· 彩票中心规定按实名制销售彩票。为确保用户中奖权益，请务必注册后，在“用户中心”的“充值”页面绑定银行卡、真实姓名和提款密码。"
          ]
        },
        {
          id: 23,
          classId: 2,
          
          title: "23、注册后为什么要绑定银行卡？",
          content: ["为了不影响您的充值、投注和提款，注册后须在用户中心绑定银行卡，提交用户真实姓名，设置提款密码。"]
        },
        {
          id: 24,
          classId: 2,
          
          title: "24、注册时把电话号码填写错误有什么影响？",
          content: ["注册时须提交用户本人真实电话号码，否则会得不到一些公告或活动通知。如用户注册时没有填写电话号码，请尽快联系客服人员进行修改。"]
        },
        {
          id: 25,
          classId: 2,
          
          title: "25、注册时填写的电话号码换了怎么办？",
          content: ["请尽快联系客服人员进行修改。"]
        },
        {
          id: 26,
          classId: 2,
          
          title: "26、真实姓名填写错误如何修改？",
          content: ["一经绑定，用户本人无法直接修改真实姓名，但可以联系客服人员进行修改。操作流程如下： ",
          "· 联系客服人员（可通过电话、QQ、邮件等途径），说明修改的原因； ",
          "· 客服部收到授权后，由专员核实信息提交报告，交领导批准签字； ",
          "· 主管领导签字后，技术专员在有人监督的情况下，修改用户的错误信息。",
          ]
        },
        {
          id: 27,
          classId: 2,
          
          title: "27、验证码有何作用？",
          content: ["设置验证码是为了提高系统的安全性，它可以有效防止针对某个特定账号的暴力破解（即用特定程序进行不断的登录尝试），使用验证码也是目前各网站通行的安全措施。"]
        },
        {
          id: 28,
          classId: 2,
          
          title: "28、登录时为什么看不到验证码或总是提示验证码不正确？",
          content: ["看不到验证码或者总是提示验证码输入错误，可能的原因有： ",
          "· 网速过慢，请多刷新几次页面。 ",
          "· 输入错误，数字有全角和半角之分，请换用半角方式输入。 ",
          "· 安全级别设置过高，请将IE的安全级别设为“默认级别”。 ",
          "· 网页没有自动更新，请先设置浏览器的“Internet临时文件”为“自动”更新。",
          ]
        },
        {
          id: 29,
          classId: 2,
          
          title: "29、忘记了登录密码怎么办？",
          content: ["· 请及时提供相应信息给客服。系统将重置一个新密码，并把新密码发送到用户注册时提交的电子邮箱中，为保障账户安全，建议用户登录后立即修改密码。"]
        },
        /* {
          id: 30,
          classId: 1,
          
          title: "2、在彩票网站注册要收费吗？",
          content: ["· 注册新用户是免费的，不收取任何费用。"]
        }, */
        {
          id: 31,
          classId: 2,
          
          title: "31、索回密码却收取不到邮件怎么办？",
          content: ["可以联系客服人员。操作流程如下： ",
          "· 确定您注册时输入的邮箱地址是您现在使用的邮箱。 ",
          "· 耐心等待，有时候网络会延时。 ",
          "· 请查看一下您的垃圾邮件中，是否有取回密码的邮件。 ",
          "· 邮箱自身的问题，存在收不到邮件的情况。 ",
          "· 您的邮箱拒收或网络等原因造成邮件接收失败。"
          ]
        },
        {
          id: 32,
          classId: 2,
          
          title: "32、如何修改登录密码？",
          content: ["操作流程如下： ",
          "· 登录后进入首页，点击右侧的“用户中心”。 ",
          "· 在“用户中心”页面左侧“账号信息”中选择“修改密码”。",
          "· 用户输入旧密码，并设置新密码。  ",
          "· 提交信息，修改密码成功，系统提示成功信息。 ",
          ]
        },
        {
          id: 33,
          classId: 2,
          
          title: "33、用户为保证账户资金安全应注意哪些事项？",
          content: ["彩民用户必须注意自己电脑中是否有键盘记录或远程控制等木马程序，使用病毒实时监控程序和网络防火墙并注意升级更新操作系统厂商所提供的安全补丁；",
          "· 尽量不要在公共场所（如网吧）等登录本网站；",
          "· 尽量在不同场合使用有所区别的密码；",
          "· 牢记密码，如作记录则应妥善保管；",
          "· 密码不得告诉他人，包括自己的亲朋好友；",
          "· 在登录或网上支付密码输入时，应防止左右可疑的人窥视；",
          "· 预留密码时不要选用您的身份证、生日、电话、门牌、街巷、重复或连续等易被他人破译的数字。建议选用既不易被他人猜到，又方便记忆的密码；",
          "· 发现泄密的危险时，及时更换密码；不定期更换密码。"
          ]
        },
        {
          id: 34,
          classId: 2,
          
          title: "34、为什么登录后长时间不登录，要重新登录？",
          content: ["用户登录后，长时间不操作电脑，系统就认为用户离开自己的电脑了。为了避免别人趁机使用您的账户投注和保护彩民用户账户的安全，系统有要求用户重新登录的设置。"]
        },
        {
          id: 35,
          classId: 2,
          
          title: "35、为什么用户不能更改注册时提交的用户名？",
          content: ["用户进行投注时，用户名是保障自身利益的唯一凭证。一经注册，不允许更改。"]
        },
        {
          id: 36,
          classId: 2,
          
          title: "36、怎么保护中奖者的个人信息？",
          content: ["您的个人信息是保密的，本站不会公布您的信息，请您放心购买。"]
        },
        {
          id: 37,
          classId: 2,
          
          title: "37、如何修改绑定的联系电话？",
          content: ["请尽快联系客服人员进行修改。"]
        },
        {
          id: 38,
          classId: 3,
          
          title: "38、使用网上银行安全吗？",
          content: ["用户在本站充值时选择任一银行卡支付通道后立即进入银行网关，银行卡资料全部在银行网关加密页面上填写，资料提交过程全部采用国际通用的SSL或SET及数字证书进行加密传输，安全性由银行全面提供支持和保护，各银行网上支付系统对网上支付的安全提供保障。"]
        },
        {
          id: 39,
          classId: 3,
          
          title: "39、通过网上充值，出现该页无法显示时怎么办？",
          content: ["· 没有升级IE浏览器，导致加密级别过低，无法进入银行系统。 请升级到8.0及以上版本。",
          "· 上网环境或上网方式受限，可能是网络服务商限制，如有条件更换一种上网方式或环境。",
          "· 瞬间网络不通，尝试刷新页面；如果刷新不能解决问题，请在IE菜单—工具—Internet选项—点击'删除cookies'和'删除文件'，用以清除临时文件。"
          ]
        },
        {
          id: 40,
          classId: 3,
          
          title: "40、没有接到银联打过来的电话怎么办？",
          content: ["在线支付是即时向银行系统提交支付信息的，所以如果出现银行卡卡内金额不足、意外断线等状况而导致支付的不成功，请重新提交一次充值并按在线支付的方法操作。"]
        },
        {
          id: 41,
          classId: 3,
          
          title: "41、提款金额有没有限制？",
          content: ["本站单笔提款最低金额为10元，无最高限制。"]
        },
        {
          id: 42,
          classId: 3,
          
          title: "42、提款次数有没有限制？",
          content: ["本公司不限制提款次数。"]
        },
        {
          id: 44,
          classId: 3,
          
          title: "44、提款不成功怎么办？",
          content: ["提款不成功分两种情况： ",
          "· 提款申请未成功： ",
          "1、提款金额大于账户实有金额。 ",
          "2、提款时填写的提款密码与用账户信息设置的提款密码不一致。 ",
          "3、银行卡信息不符合规定格式。 ",
          "· 申请提款成功，但款项没有到达指定账户：",
          "1、银行卡卡号填写错误，与用户姓名不符，银行退单。 ",
          "一旦发生上述现象，请及时联系客服，由客服人员为您服务。",
          ]
        },
        {
          id: 45,
          classId: 3,
          
          title: "45、如何查询提款记录？",
          content: ["· 用户登录后点击首页右侧的提款。 ",
          "· 在提款页面，点击右上角'查看提款记录'。"
          ]
        },
        {
          id: 46,
          classId: 4,
          
          title: "46、我从来没买过彩票，这些彩种都怎么玩？",
          content: ["后点击首页的“玩法规则”后进入玩法规则页面，选择想要投注的彩种并查看其详细玩法。"]
        },
        {
          id: 47,
          classId: 4,
          
          title: "47、什么是标准投注？",
          content: ["标准投注包括单式投注和复式投注。"]
        },
        {
          id: 48,
          classId: 4,
          
          title: "48、什么是单式投注？",
          content: ["单式投注即用户选择一注号码进行投注。"]
        },
        {
          id: 49,
          classId: 4,
          
          title: "49、什么是复式投注？",
          content: ["复式投注即用户将两注以上号码的组合方式作为一组投注号码同时投注"]
        },
        {
          id: 50,
          classId: 4,
          
          title: "50、什么是机选投注？",
          content: ["机选指由系统随机产生投注号码进行投注。"]
        },
        {
          id: 51,
          classId: 4,
          
          title: "51、什么是直选投注？",
          content: ["直选指将所选号码以唯一的排列方式进行投注。"]
        },
        {
          id: 52,
          classId: 4,
          
          title: "52、什么是组选投注？",
          content: ["组选指将所选号码的所有排列方式作为一注号码进行投注。如一注3D组选号码的3个数字有两个数字相同，则有3种不同的排列方式，因而就有3个中奖机会，这种组选投注方式简称组选3。如一注3D组选号码的3个数字各不相同，则有6种 不同的排列方式，因而就有6个中奖机会，这种组选投注方式简称组选6。"]
        },
        {
          id: 53,
          classId: 4,
          
          title: "53、什么是追号投注？",
          content: ["追号指将一注或一组号码进行两期或两期以上的投注。追号可分为连续追号和间隔追号，连续追号指追号的期数是连续的，间隔追号指追号的期数不连续。"]
        },
        {
          id: 54,
          classId: 4,
          
          title: "54、什么是和值投注？",
          content: ["和值指投注各号码相加之和，如3D号码123，其和值为6。和值投注即用该和值的所有号码进行投注，如用户选择3D直选和值1，共3注：001、010和100。"]
        },
        {
          id: 55,
          classId: 4,
          
          title: "55、什么是包号投注？",
          content: ["包号投注指将用户所选择号码的所有组合形式进行投注。如3D组三包号01，共2注：001和110。"]
        },
        {
          id: 56,
          classId: 4,
          
          title: "56、什么是胆拖投注？",
          content: ["胆拖投注也叫基数组合投注，通常由胆码和拖码组成。胆码是用户认为出现机会非常大的号码，在所投注的每一注彩票里都固定出现；拖码即彩民补充的其他不同的号码。拖码与胆码共同组成一注完整的投注号码。"]
        },
        {
          id: 57,
          classId: 4,
          
          title: "57、为什么号码导入不成功？",
          content: ["号码导入，有两点要求：号码导入时，必须是文本格式（.txt） ",
          "文本内容有格式要求(双色球、3D)： ",
          "a、 确认要导入的号码文件位置,如果没有请新建(英文状态下书写)；",
          "b、 文本格式按照相关彩种单式手动输入号码的规则；"
          ]
        },
        {
          id: 58,
          classId: 4,
          
          title: "58、如何查询追号记录？",
          content: ["· 用户登录本站，进入会员中心，点击左侧“交易记录”。 · 选择下拉“全部投注”。 · 选择“追号记录”查看，即可查看追号记录。"]
        },
        {
          id: 59,
          classId: 1,
          
          title: "59、对于投注号码是否有进行规定？",
          content: ["您好，公司对于下注单注或单项号码等限制投注不可超过总号码的三分之二、涉嫌无风险投注公司根据会员投注的数量、金额等根据实际情况处理、公司保留严重者冻结会员账号不予结余的权利，谢谢"]
        },
        {
          id: 60,
          classId: 1,
          
          title: "60、彩八八彩票规则",
          content: ["重要通知：禁止刷7码以上，禁止利用平台进行套利、套现、对打等违规行为，风控系统检测到将对该账号进行封号处理，请遵守“彩八八彩票”游戏规则，祝您游戏愉快，盈利多多！！！"]
        },
      ]
    };
  },
  computed:{
      afterData(){
          let id=this.$route.params.listId+"";
          let first=id.substring(0,1);
          let second=id.substring(1);
          this.activeName=Number(second);
          let arr=[];
        if(first==5){
            return this.data
        }else{
            arr=this.data.filter(res=>{
                return res.classId==first
            })
            return arr;
        }
      }
  }
};
</script>
<style lang="less" scoped>

</style>

